import { Box, Button, Typography } from '@mui/material';
import { useState } from 'react';

const Description = ({ iteration = 2 }) => {
  const [showFullText, setShowFullText] = useState(false);
  const texts = [
    {
      id: 'green-home',
      title: 'خانه سبز',
      text: () => {
        return (
          <Typography
            variant="p"
            sx={{
              fontFamily: 'IRANSansfa',
              lineHeight: '24px',
              color: '#014351',
            }}
          >
            انتخاب ما برای کسانی که انتخابمون میکنن سبز شدنه؛ نمادی که زندگی رو
            فریاد میزنه و چی بهتر از یه خونه سبز؟
            <br />
            راه حل دوباره برای سبز شدن خونه هاتون خیلی ساده ست؛ همراهی و هم قدمی
            با دوباره ای ها. شما میتونین با تماس به ۳۶۳۳به بخش پشتیبانی ما متصل
            بشید و با ثبت سفارش، آدرس محل مسکونی و زمان مدنظرتون، پسماند خشک
            ارزشمند رو تحویل گردآوران دوباره بدین.
            <br />
            همه ما دلمون میخواد که محیط زندگی پاک و سالمی داشته باشیم. نگاه کردن
            به تصویر کوه زباله ها در هر شهری که باشیم؛ بهمون یادآوری می­‌کنه که
            برای نجات زمین فرصت زیادی نداریم؛ انگار ارتش زباله ها با همه قوا
            داره به زمین ما حمله میکنه. شاید براتون جالب باشه که بدونین این قدری
            که ما آدما فکر میکنیم دستمون هم خالی نیست. برای شروع میتونیم بریم
            سراغ تفکیک پسماند خشک ارزشمند در خونه هامون. این همون کاریه که هزار
            تا شنبه قرار بوده انجامش بدیم و همیشه عقب انداختیمش. این روند از
            طریق اپلیکیشن دوباره هم امکان پذیره.
            <br />
            دوباره دست شمارو باز میذاره تا از هر مسیری که براتون راحت تره کنار
            ما بایستین و به ما بپیوندین.
          </Typography>
        );
      },
    },
    {
      id: 'green-shop',
      title: 'دکان سبز',
      text: () => {
        return (
          <Typography
            variant="p"
            sx={{
              fontFamily: 'IRANSansfa',
              lineHeight: '24px',
              color: '#014351',
            }}
          >
            ما در «دوباره» به همه اصناف فکر کردیم. اصناف پزشکی و سلامت، پوشاک،
            خدمات ساختمانی و تأسیسات، خدمات عمومی و دولتی، غذا و رستوران، صنعت،
            تولید، کشاورزی، آرایشی، بهداشتی، آموزش و پژوهش، الکترونیک، دیجیتال،
            حمل‌ونقل، سفر و گردشگری، چاپ و تبلیغات، ورزش، سرگرمی، هنر، خودرو،
            وسایل نقلیه، سایر اصناف می‌تونن در طرح «دکان سبز» دوباره همراه ما
            باشن.
            <br /> طرح «دکان سبز» هم یکی از طرح‌های سبزتر شدن شهر محسوب می‌شه که
            مرتبط با جامعه صنفی شهر رشته.به این صورت که اصناف از طریق سرویس‌های
            ۳۶۳۳_ وب اپ و اپلیکیشن و کیوسک‌ها می‌تونن پسماندهاشون رو از طریق
            سرویس‌های بالا، به دست دوباره‌ای‌ها برسونن تا ما ازشون خریداری کنیم.
            <br />
            دلت می‌خواد صنف برتر بشی؟ دلت می‌خواد از مزایای تبلیغات محیطی دوباره
            استفاده کنی و در قرعه‌‌کشی‌های ما شرکت کنی؟ ما کمکتون می‌کنیم که در
            این راه پا بذارین و هم به مسئولیت اجتماعی‌تون عمل کنین؛ هم درآمدی از
            فروش پسماندهای خشک ارزشمندتون داشته باشین.
            <br /> در این مسیر یکی از کارهای مدنظرِ دوباره، انتخاب «صنف سبز»
            برتره، که به‌صورت قرعه‌‌کشی‌ بین واحدهای صنفی، ادارات و واحدهای
            تجاری انتخاب می‌شه و درانتها براشون تبلیغی از سمت دوباره انجام
            می‌شه. بالاخره یه روزی، یه جایی، هر کدوممون تصمیم می‌گیریم پرچم صلح
            با زمین رو بالا ببریم و دوباره کنار شما در این راهه.
          </Typography>
        );
      },
    },
    {
      id: 'green-office',
      title: 'اداره سبز',
      text: () => {
        return (
          <Typography
            variant="p"
            sx={{
              fontFamily: 'IRANSansfa',
              lineHeight: '24px',
              color: '#014351',
            }}
          >
            مدیر سبز شدن، یه انتخابه برای اونایی که جنس دغدغه هاشون به ما
            «دوباره‌ای‌ها» نزدیکه.
            <br /> ما در دوباره بهتون کمک می‌کنیم که پسماند خشک ارزشمندت رو به
            ما تحویل بدی و بخشی از عواید فروش این پسماندها رو به‌عنوان مسئولیت
            اجتماعی، به سمن‌های محیط زیستی یا خیریه‌ها اعطا کنی.
            <br /> ما هر بار یکی از ادارات شهر رشت رو سبز می‌کنیم. این داستان
            برای خودمون هم خیلی هیجان انگیزه. در اون اداره یه مأموریت جذاب
            داریم؛ جانمایی سطل هوشمند تفکیک پسماند.
            <br /> این سطل مجهز به صفحه نمایش و سنسور حساس به پر شدنه، وقتی که
            پر شد؛ به ما خبر می‌ده و بقیه راه رو به ما بسپر. ما پسماند‌هات رو
            تحویل می‌گیریم و در «آیین اعطای چک» در ادارات سبز بخشی از عواید فروش
            این پسماندها رو به‌عنوان مسئولیت اجتماعی، از طرف اداره سبز شما به
            سمن‌های محیط زیستی یا خیریه‌ها اعطا می‌کنیم.
            <br /> علاوه بر همه این‌ها، هر چقدر که به ما کاغذبازیافتی تحویل بدی،
            ما ده درصد از اون رو به‌صورت «کاغذ نو» بهت تحویل می‌دیم.
            <br /> همین الان اداره‌ات رو سبز کن.
          </Typography>
        );
      },
    },
    {
      id: 'green-factory',
      title: 'کارخانه سبز',
      text: () => {
        return (
          <Typography
            variant="p"
            sx={{
              fontFamily: 'IRANSansfa',
              lineHeight: '24px',
              color: '#014351',
            }}
          >
            بررسی پسماند کارخونه‌های شهر رشت با توجه به شرایط اقلیمی خاص منطقه و
            محیط­‌زیست آسیب پذیرش، اهمیت بسیار بسیار ویژه­ ای داره.
            <br />
            طبق نتایج به‌دست اومده با تحقیقات و مطالعات دانشمندان این زمینه، از
            تجزیه و تحلیل اطلاعات گروه­‌های مختلف تولیدی، کارخونه‌ها می تونن
            بیش­ترین ضایعات شبه خونگی رو تولید کنن، یعنی از هر منبع تولید ضایعات
            دیگه ای که فکرشو میکنیم بیشتر!!!
            <br />
            بیش­ترین شیوه‌ای که برای نگه­داری ضایعات تا زمان دفعشون استفاده
            می‌شه، انبارهای روباز محیط کارخونه ست که باعث به وجود اومدن آلودگی
            می­‌شه.
            <br />
            دوباره با اجرای طرح‌های مختلف تلاش می‌کنه تا با دریافت پسماند
            کارخونه‌ها هم به دغدغه‌های زیست محیطی اونا پاسخ بده و هم با خرید
            پسماند باعث ایجاد انگیزه اقتصادی بشه.
            <br />
            این‌جوری یه قدم بزرگ دیگه برای رسیدن به زمین سبز برداشتیم.
          </Typography>
        );
      },
    },
    ,
  ];
  return (
    <Box
      sx={{
        display: 'flex',
        gap: 2,
        flexDirection: 'column',
        position: 'relative',
        direction: 'rtl',
        m: '0 auto',
        px: '30px',
        width: { xs: '90%', lg: '75%' },
      }}
      id={texts[iteration].id}
    >
      <Typography
        variant="h5"
        sx={{ color: '#014351', position: 'relative', zIndex: '1' }}
      >
        {texts[iteration].title}
      </Typography>
      <div
        style={{
          maxHeight: `${showFullText ? '' : '240px'}`,
          textOverflow: 'ellipsis',
          display: 'block',
          overflow: 'hidden',
        }}
      >
        {texts[iteration].text()}
      </div>

      {!showFullText && (
        <>
          <Box
            sx={{
              width: '100%',
              display: 'flex',
              justifyContent: 'flex-end',
              mt: '55px',
              position: 'relative',
              zIndex: '1',
            }}
          >
            <Button
              variant="contained"
              sx={{
                height: '34px',
                backgroundColor: '#014351',
                borderRadius: '17px',
                px: '30px',
                color: '#FFF',
                '&:hover': { backgroundColor: '#F4B23E' },
              }}
              onClick={() => setShowFullText(true)}
            >
              بیشتر بدانید
            </Button>
          </Box>
          <Box
            sx={{
              position: 'absolute',
              width: '100%',
              bottom: '0',
              left: '0',
              background: 'rgb(255,255,255)',
              background:
                'linear-gradient(0deg, rgba(255,255,255,1) 39%, rgba(255,255,255,0) 100%)',
              height: '250px',
              zIndex: '0',
            }}
          />
        </>
      )}
    </Box>
  );
};

export default Description;
