const { Box, Typography } = require('@mui/material');

const LeftPart = () => {
  return (
    <Box
      sx={{
        width: { xs: '100%', md: '50%' },
      }}
    >
      <Box
        sx={{
          direction: 'rtl',
          display: 'flex',
          gap: 2,
          flexDirection: 'column',
          padding: { xs: '35px 20px', md: '35px 50px' },
        }}
      >
        <Typography
          variant="h4"
          sx={{
            color: '#014351',
            fontWeight: '500',
            textAlign: { xs: 'center', md: 'right' },
          }}
        >
          دغدغه دوباره
        </Typography>
        <Typography
          variant="p"
          sx={{
            fontFamily: 'IRANSansfa',
            lineHeight: '24px',
            color: '#014351',
            textAlign: { xs: 'center', md: 'right' },
          }}
        >
          داستان دفن سی و چند ساله زباله ها تو سراوان و شیرابه ای که آب و خاک و
          محصولات کشت شده رو آلوده و مسموم میکنه، با هجوم حشرات و بوی تعفن و
          شیوع انواع و اقسام بیماری هایی که برای مردم منطقه مشکل ساز شده، داستان
          ترسناکیه. یه داستان واقعی که حسابی سایه آرامش رو از سر مردم منطقه
          برداشته و برای دوباره هم تبدیل به یه دغدغه اساسی و البته پرچالش شده.
          <br />
          دغدغه ای که با زندگی و سلامت هممون ارتباط داره.
          <br />
          ورود شیرابه های زباله به تالاب انزلی و تاثیر منفی آن روی اکوسیستم یکی
          از معضلات بزرگ و پیچیده دیگه ست که نمیشه نادیده اش گرفت و ازش عبور
          کرد.
          <br />
          ما میدونیم مسئله سراوان یک مسئله کلان اجتماعیه؛ برای همینه که ما هم
          بهش به چشم یک مسئولیت اجتماعی نگاه میکنیم تا بتونیم کنار مردم و مطالبه
          عمومیشون بایستیم.
          <br />
          برای اینکه بتونیم از این کوه زباله که به بیش از صد متر رسیده، حتی
          سانتیمتری کم کنیم.
        </Typography>
      </Box>
    </Box>
  );
};

export default LeftPart;
