export const blog2 = {
  id: 1,
  category: 'زندگی روزانه',
  date: ['۲۵ خرداد ۱۴۰۲', '۱۴۰۲/۰۳/۲۵ - ۱۸:۳۰'],
  tags: ['مواد غذایی', 'بسته بندی', 'محیط زیست', 'سلامتی', 'آینده'],
  mainTitle: 'باورهای نادرست درمورد بسته‌بندی',
  subTitles: [
    'هر چیزی که روی برچسب محصولات است، باور نکنید',
    'کدهای بازیافت پلاستیک روی ظروف محصول',
  ],
  body: [
    'نماد بازیافت جهانی بیانگر این است که محصول یا بسته‌بندی قابل بازیافت است یا از مواد بازیافتی ساخته شده است. معمولاً روی بسته‌بندی نوشته شده که شامل کدام حالت است. البته قانونی در این مورد موجود ندارد. اگرچه این نماد، نشانگر بازیافتی بودن بسته است ولی به این معنی نیست که سرویس بازیافت محلی آن را برای بازیافت می‌پذیرد. بسیاری از موادی که از نظر فنی قابل بازیافتند در بازار بازیافت سودآور نیستند. برنامه بازیافتی هر جامعه متفاوت است. بعضی شهرها مواد بازیافتی بدون سود را می‌پذیرند اما همه آن‌ها این کار نمی‌کنند. شما باید با برنامه بازیافت محلی خود آشنا شوید.',
    'به پلاستیک توجه ویژه‌ای داشته باشید. گرچه پلاستیک کمتر از دیگر مواد بازیافت می‌شود اما تمام بسته‌بندی‌های پلاستیکی دارای نماد بازیافتند. این به خاطر اعداد قابل رهگیری است. این اعداد کدهای شناسایی رزین (RIC) هستند؛ اعدادی که نوع پلاستیکی که کالا از آن ساخته شده است را نشان می‌دهد. بازیافت‌کنندگان برای تعیین روش بازیافت به این کدها نیاز دارند. صرف نظر قابلیت بازیافت، بیشتر ایالت‌های امریکا  به این کد روی پلاستیک‌ها نیاز دارند.',
    'برچسب‌های بازیافت استاندارد هستند. برچسب‌گذاری محصول برای همه رایگان است به همین دلیل نمی‌توانید به نماد جهانی بازیافت اعتماد کنید. پس نباید تعجب کرد که برچسب‌های بازیافت استاندارد نیستند. جدا از موضوع پلاستیک، دریافتن معنای نماد بازیافت (نبود آن) بسیار سخت است. ما واقعاً به کیفیت بالاتری از برچسب‌گذاری نیازمندیم. بعضی از سایت‌ها، کسب و کارها  را تشویق می‌کنند تا با کمک به آنها بسته‌هایشان را بازیافت کنند. برچسب‌های How2Recycle اطلاعات زیادی را در قالب استاندارد ارائه می‌دهد که شامل اطلاعاتی در مورد بازیافت مؤثر هستند مثلاً چه گستره‌ای از بازیافت برای انواع بسته بندی در دسترس است، بسته بندی به کدام دسته از مواد تعلق دارد و نماد به کدام قسمت از بسته اشاره دارد.',
    '1- PETE (پلاستیک کد 1): پلی‌اتیلن ترفتالات، قابل بازیافت‌ترین و معمول‌ترین پلاستیک است که به عنوان بطری‌های آب، نوشابه و ظرف‌های یکبار مصرف و غیره استفاده می‌شود. محکم و در برابر گرما مقاوم است و با بازیافت به بطری‌های آب، ساک، لباس، کفش، روکش مبل، فیبرهای پلی‌استر و غیره تبدیل می‌شود.',
    '2- HDPE (پلاستیک کد 2): پلی‌اتیلن با غلظت بالا که به‌راحتی و به سرعت بازیافت می‌شود. پلاستیک نوع خشک است اما زود شکل می‌گیرد و معمولا در قوطی شوینده‌ها، بطری‌های شیر، قوطی‌های آب‌میوه، کیسه‌های زباله و غیره به کار می‌رود. با بازیافت تبدیل به لوله‌های پلاستیکی، قوطی‌ شوینده‌ها، خودکار، نیمکت و غیره می‌شود. انواع دیگری نیز وجود دارند که به آن ها در مقالات بعد خواهیم پرداخت.',
    'نماد بازیافت جهانی بیانگر این است که محصول یا بسته‌بندی قابل بازیافت است یا از مواد بازیافتی ساخته شده است. معمولاً روی بسته‌بندی نوشته شده که شامل کدام حالت است. البته قانونی در این مورد موجود ندارد. اگرچه این نماد، نشانگر بازیافتی بودن بسته است ولی به این معنی نیست که سرویس بازیافت محلی آن را برای بازیافت می‌پذیرد. بسیاری از موادی که از نظر فنی قابل بازیافتند در بازار بازیافت سودآور نیستند. برنامه بازیافتی هر جامعه متفاوت است. بعضی شهرها مواد بازیافتی بدون سود را می‌پذیرند اما همه آن‌ها این کار نمی‌کنند. شما باید با برنامه بازیافت محلی خود آشنا شوید.اکنون دیگر نمی‌توانیم موضوع بسته بندی های اطرافمان را نادیده بگیریم. مسئولیت‌پذیری و پیشگیری از مشکلات، بسیار مهم است.اثر اشتباهات مان در طول زندگی ما به سطح عادی بازنخواهد گشت، اما امروز می‌توانیم با ایجاد یک تغییر، دنیای بهتری را برای نسل آینده ایجاد کنیم.',
  ],
  image: ['/images/blog2.jpg', '/images/blog22.jpg'],
  writer: 'مهدیسا صفری خواه',
  reading_length: '۶',
  views: '۱۴',
};
