export const blog4 = {
  id: 3,
  category: 'کاغذ و زباله',
  date: ['۰۵ مرداد ۱۴۰۲', '۱۴۰۲/۰۵/۰۵ - ۰۵:۰۵'],
  tags: ['تجدید پذیری', 'ایالات متحده', 'آینده نگری', 'روش های نوین', 'کاغذ'],
  mainTitle: 'درباره زباله های کاغذی کمی بیشتر بدانیم',
  body: [
    'آیا شما به حجم زباله کاغذی که تولید می‌کنید آگاه هستید؟ آیا به دلیل راحتی، به جای نسخه‌های دیجیتال از نسخه‌های چاپی استفاده می‌کنید؟ هنوز از فرم‌های کاغذی استفاده می‌کنید؟ از قراردادهای‌تان برای امضا پرینت می‌گیرید؟',
    'این کارها جدا از اینکه برای محیط زیست مضرند، وقت و پول شما را هم هدر می‌دهند. بیایید نگاهی به مقدار کاغذی که واقعاً مصرف می‌کنیم و مقدار زباله‌ای که تولید می‌کنیم، بیندازیم. شاید شما نمی‌دانید که چقدر زباله کاغذی تولید می‌کنید اما بهتر است  این آمار را بدانید. - درسال ۲۰۱۴ ایالات متحده امریکا ۶۰.۲ میلیون تن زباله کاغدی تولید کرد که برابر است با ۱۴۰۰۰ فیل آفریقایی. ۲- در سال ۲۰۱۱، ۲۸ درصد از زباله‌های ایالات متحده زباله‌های کاغذی بوده است. ۳- ۶۰ درصد از زباله‌های مدارس،کاغذی هستند. ۴-تولید کاغذ بازیافتی نسبت به ساخت کاغذ از خمیر چوب بکر، به ۴۰ درصد انرژی کمتر نیاز دارد. ۵- پیشگیری از تولید یک تن زباله کاغذی بین ۱۵ تا ۱۷ درخت بالغ را نجات می‌دهد. ۶- بازیافت یک تن کاغذ، انرژی کافی برای گرمایش یک خانه با  متوسط به مدت شش ماه را ذخیره می‌کند.',
    '۷- به طور تخمینی ۲۰۶ میلیارد کارت تبریک، هرساله در آمریکا فرخته می‌شود که می‌تواند یک زمین فوتبال ده طبقه را پر کند. ۸- زمانی که کاغذ در محل دفن زباله قرار می‌گیرد و بازیافت نمی‌شود، در دراز مدت گازهای گلخانه‌ای منتشر می‌کند. و همچنین بسیاری موارد تاسف برانگیز و اندیشه طلب محیط زیستی دیگر در مورد کاغذ و وسایل و سایر موارد کاغذی.',
    '- تولید یک تن زباله کاغذ اداری با کاغذ بازیافتی موجود می‌تواند بین ۳۰۰۰ تا ۴۰۰۰ کیلو وات بر ساعت نسبت به همان مقداری که با محصولات چوب بکر ساخته شده است، صرفه جویی کند.- یک کارمند امریکایی به طور متوسط هرسال حدود ۵۰۰ لیوان یک بار مصرف استفاده می‌کند. - روزانه بیش از ۳۰۰۰ تن زباله حوله کاغذی تنها در ایالات متحده امریکا تولید می‌شود. - یک فرد به طور متوسط در سال، ۲۴۰۰ تا ۳۰۰۰ دستمال کاغذی در محل کار استفاده می‌کند. - ایالات متحده سالانه ۲۴ میلیارد روزنامه، ۲ میلیارد کتاب و ۳۵۰ میلیون مجله منتشر می‌کند. - یک آمریکایی به طور متوسط سالانه معادل یک درخت صنوبر داگلاس ۱۰۰ فوتی، کاغذ و محصولات چوبی استفاده می‌کند. - زمانی که کاغذ در محل دفن زباله قرار می‌گیرد و بازیافت نمی‌شود، در دراز مدت منتشر کننده گازهای گلخانه‌ای می‌شود. در سال ۲۰۰۶، ۴۲ میلیون تن کربن دی‌اکسید از متان تولید شده از تجزیه محصولات کاغذی در هوا منتشر شده است.',
    ' استفاده از فرم‌های کاغذی هزینه‌های پنهان بیشتری دارد. زمان آن رسیده که فرم‌های کاغذی خود را به فرم‌های دیجیتال تبدیل کنید. فرم‌های دیجیتال تضمین می‌کنند که داده‌ها همیشه به روز هستند و نیازهای مشتریان و کارکنان را برطرف می‌کنند. و این تضمین‌کننده یک ارتباط موفق و راحت برای هر دو طرف است. لینک سایت منبع آمار های درج شده در این مقاله: ',
    'https://moreapp.com/en/blog/paper-waste/',
  ],
  subTitles: [
    'حقایقی در مورد زباله‌های کاغذی',
    'حقایقی بیشتر در مورد زباله‌های کاغذی',
  ],
  image: ['/images/blog4.jpg', '/images/blog42.jpg'],
  writer: 'مهدیسا صفری خواه',
  reading_length: '۱۲',
  views: '۲۲',
};
